% МНОГОКАНАЛЬНАЯ СМО

function practic_3

%% расчет параметров 
P = [0    0.1  0.3  0.6;...
     0.2  0    0.2  0.6;...
     0.4  0.1  0    0.5;...
     0.3  0.2  0.5  0 ];
N = 5; 
S = 8;
R = 1;

w = fsolve(@wfun,[1;0;0;0]);
sum(w) % !=1 

     function F = wfun(w)
         for i=1:4
          F(1) = - w(1) + w(i)*P(i,1) + w(i)*P(i,1) + w(i)*P(i,1) + w(1)*P(i,1);
          F(2) = - w(2) + w(i)*P(i,2) + w(i)*P(i,2) + w(i)*P(i,2) + w(1)*P(i,2);
          F(3) = - w(3) + w(i)*P(i,3) + w(i)*P(i,3) + w(i)*P(i,3) + w(1)*P(i,3);
          F(4) = - w(4) + w(i)*P(i,4) + w(i)*P(i,4) + w(i)*P(i,4) + w(1)*P(i,4);
          F = [F(1); F(2); F(3); F(4) ; sum(w) - 1];
         end
     end 
 
%% решение

    
end
